clear;

%%%%%%%%%%%%%%%%%%%%%%Copyright@MMMLab_NKU%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%体系变量设置%%%%%%%%%%%%%%%%%%%%%%%%%%%%
global L;
global SPIN;
global Jx;
global Jy;
global Jxy;

L=100;               %水平方向三角格子的"边长"，即沿着一个晶格方向的"原子"数
T_max=6.5;            %约化温度上限
T_min=0;            %约化温度下限
num_T=50;           %温度采样数
H=0;                %约化磁场强度
dH=0.1;             %磁场微小改变
Jx=6;
Jy=6;
Jxy=0;
%J=1;               %交换积分设置为1
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%计算参数设置%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Warmup=0.05*L*L;     %过渡到稳态步数
MCstep=10*L*L;     %求基态的步数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%函数说明%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Monte_Carlo(T,H)     %无返回值，进行一步蒙卡
% Cal_E(H,Jx,Jy,Jxy)             %返回全局变量SPIN的能量
% Cal_E1(SPIN1,H,Jx,Jy,Jxy)      %返回SPIN1的能量
% Flip_Spin(SPIN,m,n)  %翻转SPIN中第m+1行第n+1列的值，即翻转mn自旋
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


T_temp=linspace(T_min,T_max,num_T);
out=zeros(num_T,2);
outd=zeros(num_T,2);

for T=1:num_T
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %%%%%%%%%%%%初始化%%%%%%%%%%%%初始化%%%%%%%%%%%%%初始化%%%%%%%%%%%
    SPIN = ones(L+2,L+2);		
    %数组维度为(nn+2)*(mm+2),
    %设置每个"原子"的初始磁矩,
    %第0行、第0列和第mm+1行、第nn+1列用来存放边界条件.
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    
    
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %%%%%%%%%%%%%预热%%%%%%%%%%%%%%预热%%%%%%%%%%%%%预热%%%%%%%%%%%%%%
    Monte_Carlo_warmup(T_temp(T),H,Warmup);
    %预热步数设置为 Warmup
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%预热完毕%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    
    
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %%%%%%%%%%%%%蒙卡%%%%%%%%%%%%%%蒙卡%%%%%%%%%%%%%%蒙卡%%%%%%%%%%%%%
    out(T,:) = Monte_Carlo(T_temp(T),H,MCstep);
    outd(T,:)=Monte_Carlo(T_temp(T),H+dH,MCstep);
    %MC采样步数设置为 MCstep,
    %统计采样结果：磁化强度,热力学熵，相关函数.
    %%%%%%%%%%%%%%%%%%%%%%%%%%%蒙卡完毕%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    T
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%结果输出%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
       %第一列数据，温度
OUT(:,2)=(1/(L*L))*out(:,1);  %第二列数据，磁化强度
%OUT(:,3)=(1/(L*L))*out(:,2);  %第三列数据，热力学熵
OUT(:,1)=T_temp';             %第一列数据，温度
figure(1);
plot(OUT(:,1),out(:,1),'r');
xlabel('Temperature(K)');
ylabel('Total Magnetic Moment( \mu_B)');
title(['Total Magnetic Moment for ','H=',num2str(H)]); %绘制总磁矩随温度变化图

figure(2);
plot(OUT(:,1),OUT(:,2),'g');
xlabel('Temperature(K)');
ylabel('Magnetization( \mu_B/unit cell)');
title(['Magnetization for ','H=',num2str(H)]); %绘制磁化强度随温度变化图

figure(3);
plot(OUT(:,1),-(1/(L*L))*(outd(:,1)-out(:,1))/dH,'b');
xlabel('Temperature(K)');
ylabel('Differential Magnetic Susceptibility');
title(['Differential Magnetic Susceptibility for ','H=',num2str(H)]); %绘制微分磁化率随温度变化图
 
 
%%%%%%%%%%%%%%%%%%%%%%%%%%%结果输出完毕%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%